{
  "_name_or_path": "dccuchile/bert-base-spanish-wwm-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "abrir_programa",
    "1": "agradecimiento",
    "2": "apagar_pc",
    "3": "bajar_volumen",
    "4": "buscar_web",
    "5": "cambiar_volumen",
    "6": "despedida",
    "7": "fallback",
    "8": "interaccion",
    "9": "reiniciar_pc",
    "10": "reproducir_audio",
    "11": "saludo",
    "12": "subir_volumen"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "abrir_programa": 0,
    "agradecimiento": 1,
    "apagar_pc": 2,
    "bajar_volumen": 3,
    "buscar_web": 4,
    "cambiar_volumen": 5,
    "despedida": 6,
    "fallback": 7,
    "interaccion": 8,
    "reiniciar_pc": 9,
    "reproducir_audio": 10,
    "saludo": 11,
    "subir_volumen": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
